In [1]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series([1,2,None],dtype='float64')
string_data
string_data.notnull()

0     True
1     True
2    False
dtype: bool

In [4]:
float_data = pd.Series(["aardvark",np.nan,None,"avocado"])
float_data
float_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA

In [6]:
data = pd. Series ([1, np.nan, 3.5, np.nan, 7])
data
#data.isnull()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [7]:
data.dropna ()
#OR
#data[data.notnull ()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan], [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
cleaned_data= data.dropna()
cleaned_data

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis = "columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
#creates a Numpy array with shape (7, 3) filled with random numbers
df = pd.DataFrame(np.random.standard_normal ((7, 3)))
df
df. iloc[:4, 1] = np. nan
df.iloc[:2, 2] = np. nan
df

          0         1         2
0 -0.788113       NaN       NaN
1 -0.941166       NaN       NaN
2 -1.225068       NaN  0.526533
3 -1.298456       NaN  0.041837
4 -0.357596  0.345612  0.434993
5 -0.042970 -0.852592 -0.544134
6 -0.230233  0.705118 -0.156331

In [20]:
df. dropna ()

          0         1         2
4 -0.357596  0.345612  0.434993
5 -0.042970 -0.852592 -0.544134
6 -0.230233  0.705118 -0.156331

In [21]:
df.dropna(thresh=2)

          0         1         2
2 -1.225068       NaN  0.526533
3 -1.298456       NaN  0.041837
4 -0.357596  0.345612  0.434993
5 -0.042970 -0.852592 -0.544134
6 -0.230233  0.705118 -0.156331

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.788113  0.500000  0.000000
1 -0.941166  0.500000  0.000000
2 -1.225068  0.500000  0.526533
3 -1.298456  0.500000  0.041837
4 -0.357596  0.345612  0.434993
5 -0.042970 -0.852592 -0.544134
6 -0.230233  0.705118 -0.156331

In [25]:
df

          0         1         2
0 -0.788113       NaN       NaN
1 -0.941166       NaN       NaN
2 -1.225068       NaN  0.526533
3 -1.298456       NaN  0.041837
4 -0.357596  0.345612  0.434993
5 -0.042970 -0.852592 -0.544134
6 -0.230233  0.705118 -0.156331

In [26]:
df.fillna({1:0.5,2:0},inplace=True)
df

          0         1         2
0 -0.788113  0.500000  0.000000
1 -0.941166  0.500000  0.000000
2 -1.225068  0.500000  0.526533
3 -1.298456  0.500000  0.041837
4 -0.357596  0.345612  0.434993
5 -0.042970 -0.852592 -0.544134
6 -0.230233  0.705118 -0.156331

In [28]:
df = pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -0.093509  0.266624  0.925312
1  0.802814 -0.550765 -1.092266
2  1.551433 -1.421901 -0.299189
3 -1.460162  0.400141  0.998554
4  1.191996 -0.591802  0.872063
5  0.844272  0.681209 -1.786611

In [29]:
df.iloc[2:,1] = np.nan
df.iloc[4:,2] = np.nan
df

          0         1         2
0 -0.093509  0.266624  0.925312
1  0.802814 -0.550765 -1.092266
2  1.551433       NaN -0.299189
3 -1.460162       NaN  0.998554
4  1.191996       NaN       NaN
5  0.844272       NaN       NaN

In [31]:
df.fillna(method = "ffill")

          0         1         2
0 -0.093509  0.266624  0.925312
1  0.802814 -0.550765 -1.092266
2  1.551433 -0.550765 -0.299189
3 -1.460162 -0.550765  0.998554
4  1.191996 -0.550765  0.998554
5  0.844272 -0.550765  0.998554

In [32]:
df.fillna(method = "ffill",limit = 2)

          0         1         2
0 -0.093509  0.266624  0.925312
1  0.802814 -0.550765 -1.092266
2  1.551433 -0.550765 -0.299189
3 -1.460162 -0.550765  0.998554
4  1.191996       NaN  0.998554
5  0.844272       NaN  0.998554

In [33]:
data = pd.Series([1.,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [34]:
data.mean()

3.8333333333333335

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64